In [1]:
import pandas as pd
import numpy as np

# How To Create a Pandas DataFrame

In [2]:
df={"name":["john","Jane","Rahul","python"],"Age":[29,25,23,45],"salary":["5000$","2500$","2000$","25000$"]}
#type(df)
data1=pd.DataFrame(df)
type(data1)

pandas.core.frame.DataFrame

In [3]:
data1

     name  Age  salary
0    john   29   5000$
1    Jane   25   2500$
2   Rahul   23   2000$
3  python   45  25000$

# How To Select Row or Column From a Pandas DataFrame

In [4]:
#select columns name, age and salary of first 2 rows
data1.iloc[0:2,0:3] #0:2 gives 0th and 1st rows and 0:3 gives 1st, 2nd and 3rd column

   name  Age salary
0  john   29  5000$
1  Jane   25  2500$

In [5]:
#select names of all rows
data1.loc[:,"name"]

0      john
1      Jane
2     Rahul
3    python
Name: name, dtype: object

# How To Add a Column or Row to a Pandas DataFrame

In [11]:
# adding new column "sex"
sex=["male","female", "male" ,"unknown"]
data1["sex"]=sex
data1

     name  Age  salary      sex
0    john   29   5000$     male
1    Jane   25   2500$   female
2   Rahul   23   2000$     male
3  python   45  25000$  unknown

In [24]:
# adding new row
person5= ["salman",39,"5599$","male"]
data1.loc[4,:]=person5

In [25]:
data1

     name   Age  salary      sex
0    john  29.0   5000$     male
1    Jane  25.0   2500$   female
2   Rahul  23.0   2000$     male
3  python  45.0  25000$  unknown
4  salman  39.0   5599$     male

# How to Delete Rows or Columns From a Pandas Data Frame

In [6]:
# dropping age column
new_data=data1.drop("Age",axis=1)
new_data

     name  salary
0    john   5000$
1    Jane   2500$
2   Rahul   2000$
3  python  25000$

In [7]:
# dropping row 5 from dataset
new_data1=data1.drop(data1.index[[1,3]], axis=0)
new_data1

    name  Age salary
0   john   29  5000$
2  Rahul   23  2000$

#  How to Rename the Rows or Columns of a Pandas DataFrame

In [8]:
# renaming salary column with income
new_col={"salary":"income"}
new_df=data1.rename(new_col,axis="columns")
new_df

     name  Age  income
0    john   29   5000$
1    Jane   25   2500$
2   Rahul   23   2000$
3  python   45  25000$

### Till now we made changes on data we created, what if we want to load data from somewhere else, like from our local disk?

### Here we use pandas library to import data from our disk.

### we use read_csv() function to read a csv file.

Ex:pd.read_csv("path of the file location/file name")

In [9]:
# we are reading odi dataset from local disk and it is a csv file.
data=pd.read_csv("C://Users/user/odi_new.csv") #reading data

# Basic commands to understand dataset are to

a)view number of rows and columns

b)Type of data in each column

c)To view few columns and rows in data to understand it

d)To see the description of data

In [10]:
#dataset name.shape, gives the number of rows and columns (rows,columns)
data.shape
#(55926 rows, 8 columns)

(55926, 7)

In [11]:
data.head() # viewing first 10 data points

,Country,Player,Runs,ScoreRate,MatchDate,Ground,Versus
0,Afghanistan,Mohammad Shahzad,118.0,97.52,2-16-2010,Sharjah CA Stadium,Canada
1,Afghanistan,Mohammad Shahzad,110.0,99.09,9-1-2009,VRA Ground,Netherlands
2,Afghanistan,Mohammad Shahzad,100.0,138.88,8-16-2010,Cambusdoon New Ground,Scotland
3,Afghanistan,Mohammad Shahzad,82.0,75.92,7-10-2010,Hazelaarweg,Netherlands
4,Afghanistan,Mohammad Shahzad,57.0,100.00,7-1-2010,Sportpark Westvliet,Canada

In [12]:
data.tail(7) # viewing first 10 data points

,Country,Player,Runs,ScoreRate,MatchDate,Ground,Versus
55919,Zimbabwe,Brian V Vitori,3.0,100.0,9-14-2011,Harare Sports Club,Pakistan
55920,Zimbabwe,Waddington Mwayenga,1.0,50.0,5-29-2004,Harare Sports Club,Australia
55921,Zimbabwe,Waddington Mwayenga,0.0,0.0,5-27-2004,Harare Sports Club,Australia
55922,Zimbabwe,Tafadzwa Kamungozi,0.0,0.0,10-10-2006,Sardar Patel Stadium,Sri Lanka
55923,Zimbabwe,Tafadzwa Kamungozi,0.0,0.0,10-8-2006,Sardar Patel Stadium,West Indies
55924,Zimbabwe,Tafadzwa Kamungozi,0.0,0.0,10-13-2006,Sawai Mansingh Stadium,Bangladesh
55925,Zimbabwe,Njabulo Ncube,0.0,0.0,10-25-2011,Queens Sports Club,New Zealand

In [13]:
data.info() # viewing information of dataset and variables

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55926 entries, 0 to 55925
Data columns (total 7 columns):
Country      55926 non-null object
Player       55926 non-null object
Runs         55926 non-null float64
ScoreRate    55926 non-null float64
MatchDate    55926 non-null object
Ground       55926 non-null object
Versus       55926 non-null object
dtypes: float64(2), object(5)
memory usage: 3.0+ MB

In [14]:
data.describe() #describe gives statistic of numeric columns

               Runs     ScoreRate
count  55926.000000  55926.000000
mean      22.241301     65.314062
std       25.552422     44.203144
min        0.000000      0.000000
25%        4.000000     37.500000
50%       13.000000     62.710000
75%       32.000000     87.500000
max      200.000000    600.000000

In [15]:
sum=data["Runs"].sum() # seeing the sum in Runs column
sum

1243867.0

In [16]:
cumsum=data["Runs"].cumsum() # seeing the cumulative sum in Runs column
cumsum.tail()

55921    1243867.0
55922    1243867.0
55923    1243867.0
55924    1243867.0
55925    1243867.0
Name: Runs, dtype: float64

In [17]:
mean=data["Runs"].mean() # seeing the mean in Runs column
mean

22.24130100489933

In [18]:
median=data["Runs"].median() # seeing the median in Runs column
median

13.0

In [19]:
mode=data["Country"].mode() # seeing the mode in Country column
mode

0    India
dtype: object

In [27]:
data["Country"].unique() # seeing the unique values in Country column

array(['Afghanistan', 'Australia', 'Bangladesh', 'Bermuda', 'Canada',
       'East Africa', 'England', 'Hong Kong', 'India', 'Ireland', 'Kenya',
       'Namibia', 'Netherlands', 'New Zealand', 'Pakistan', 'Scotland',
       'South Africa', 'Sri Lanka', 'United Arab Emirates',
       'United States', 'West Indies', 'Zimbabwe'], dtype=object)

In [ ]:
#saving the csv file in disk
data.to_csv("new_data.csv",index=False)

In [63]:
data.to_json("new_json") # saving the file to json format

In [64]:
json=pd.read_json("new_json") # reading the json file